; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_21_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20 - counter
	)
  (:init
		(= (value c0) 25)
	(= (value c1) 45)
	(= (value c2) 95)
	(= (value c3) 15)
	(= (value c4) 11)
	(= (value c5) 35)
	(= (value c6) 82)
	(= (value c7) 23)
	(= (value c8) 0)
	(= (value c9) 37)
	(= (value c10) 55)
	(= (value c11) 98)
	(= (value c12) 34)
	(= (value c13) 85)
	(= (value c14) 2)
	(= (value c15) 97)
	(= (value c16) 71)
	(= (value c17) 99)
	(= (value c18) 37)
	(= (value c19) 74)
	(= (value c20) 97)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)
	(= (rate_value c19) 0)
	(= (rate_value c20) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
	(<= (+ (value c18) 1) (value c19))
	(<= (+ (value c19) 1) (value c20))
		)
	)
)

; plan
1. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 12 of 20
2. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 12 of 20
3. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 12 of 20
4. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 12 of 20
5. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 12 of 20
6. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 12 of 20
7. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 12 of 20
8. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 12 of 20
9. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 12 of 20
10. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 12 of 20
11. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 12 of 20
12. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 12 of 20
13. (increase_rate c14)
   changed: (rate_value c14) from 7 to 8
   goals met: 12 of 20
14. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 12 of 20
15. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 12 of 20
16. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 12 of 20
17. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 12 of 20
18. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 12 of 20
19. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 12 of 20
20. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 12 of 20
21. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 12 of 20
22. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 12 of 20
23. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 12 of 20
24. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 12 of 20
25. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 12 of 20
26. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 12 of 20
27. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 12 of 20
28. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 12 of 20
29. (increment c8)
   changed: (value c8) from 0 to 5
   goals met: 12 of 20
30. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 12 of 20
31. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 12 of 20
32. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 12 of 20
33. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 12 of 20
34. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 12 of 20
35. (increment c4)
   changed: (value c4) from 11 to 14
   goals met: 12 of 20
36. (increment c4)
   changed: (value c4) from 14 to 17
   goals met: 13 of 20
37. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 13 of 20
38. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 13 of 20
39. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 13 of 20
40. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 13 of 20
41. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 13 of 20
42. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 13 of 20
43. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 13 of 20
44. (increment c8)
   changed: (value c8) from 5 to 10
   goals met: 13 of 20
45. (increment c8)
   changed: (value c8) from 10 to 15
   goals met: 13 of 20
46. (increment c8)
   changed: (value c8) from 15 to 20
   goals met: 13 of 20
47. (increment c8)
   changed: (value c8) from 20 to 25
   goals met: 14 of 20
48. (increase_rate c18)
   changed: (rate_value c18) from 0 to 1
   goals met: 14 of 20
49. (increase_rate c18)
   changed: (rate_value c18) from 1 to 2
   goals met: 14 of 20
50. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 14 of 20
51. (increase_rate c18)
   changed: (rate_value c18) from 2 to 3
   goals met: 14 of 20
52. (increase_rate c18)
   changed: (rate_value c18) from 3 to 4
   goals met: 14 of 20
53. (increase_rate c18)
   changed: (rate_value c18) from 4 to 5
   goals met: 14 of 20
54. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 14 of 20
55. (increase_rate c18)
   changed: (rate_value c18) from 5 to 6
   goals met: 14 of 20
56. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 14 of 20
57. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 14 of 20
58. (increase_rate c18)
   changed: (rate_value c18) from 6 to 7
   goals met: 14 of 20
59. (increment c18)
   changed: (value c18) from 37 to 44
   goals met: 14 of 20
60. (increase_rate c18)
   changed: (rate_value c18) from 7 to 8
   goals met: 14 of 20
61. (increment c18)
   changed: (value c18) from 44 to 52
   goals met: 14 of 20
62. (increment c18)
   changed: (value c18) from 52 to 60
   goals met: 14 of 20
63. (increment c18)
   changed: (value c18) from 60 to 68
   goals met: 14 of 20
64. (increment c18)
   changed: (value c18) from 68 to 76
   goals met: 13 of 20
65. (increase_rate c18)
   changed: (rate_value c18) from 8 to 9
   goals met: 13 of 20
66. (increase_rate c18)
   changed: (rate_value c18) from 9 to 10
   goals met: 13 of 20
67. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 13 of 20
68. (decrement c18)
   changed: (value c18) from 76 to 66
   goals met: 14 of 20
69. (decrement c17)
   changed: (value c17) from 99 to 94
   goals met: 14 of 20
70. (increment c18)
   changed: (value c18) from 66 to 76
   goals met: 13 of 20
71. (decrement c17)
   changed: (value c17) from 94 to 89
   goals met: 13 of 20
72. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 13 of 20
73. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 13 of 20
74. (increase_rate c16)
   changed: (rate_value c16) from 2 to 3
   goals met: 13 of 20
75. (increase_rate c16)
   changed: (rate_value c16) from 3 to 4
   goals met: 13 of 20
76. (increase_rate c16)
   changed: (rate_value c16) from 4 to 5
   goals met: 13 of 20
77. (increment c16)
   changed: (value c16) from 71 to 76
   goals met: 13 of 20
78. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 13 of 20
79. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 13 of 20
80. (increase_rate c16)
   changed: (rate_value c16) from 5 to 6
   goals met: 13 of 20
81. (increment c16)
   changed: (value c16) from 76 to 82
   goals met: 13 of 20
82. (increase_rate c16)
   changed: (rate_value c16) from 6 to 7
   goals met: 13 of 20
83. (increment c16)
   changed: (value c16) from 82 to 89
   goals met: 12 of 20
84. (increment c16)
   changed: (value c16) from 89 to 96
   goals met: 12 of 20
85. (decrement c15)
   changed: (value c15) from 97 to 95
   goals met: 13 of 20
86. (increase_rate c14)
   changed: (rate_value c14) from 8 to 9
   goals met: 13 of 20
87. (increment c14)
   changed: (value c14) from 2 to 11
   goals met: 13 of 20
88. (increment c14)
   changed: (value c14) from 11 to 20
   goals met: 13 of 20
89. (increment c14)
   changed: (value c14) from 20 to 29
   goals met: 13 of 20
90. (increment c14)
   changed: (value c14) from 29 to 38
   goals met: 13 of 20
91. (increment c14)
   changed: (value c14) from 38 to 47
   goals met: 13 of 20
92. (increment c14)
   changed: (value c14) from 47 to 56
   goals met: 13 of 20
93. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 13 of 20
94. (increment c14)
   changed: (value c14) from 56 to 66
   goals met: 13 of 20
95. (increment c14)
   changed: (value c14) from 66 to 76
   goals met: 13 of 20
96. (increment c14)
   changed: (value c14) from 76 to 86
   goals met: 14 of 20
97. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 14 of 20
98. (increment c3)
   changed: (value c3) from 15 to 23
   goals met: 13 of 20
99. (increment c3)
   changed: (value c3) from 23 to 31
   goals met: 13 of 20
100. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 13 of 20
101. (increment c4)
   changed: (value c4) from 17 to 21
   goals met: 13 of 20
102. (increment c7)
   changed: (value c7) from 23 to 29
   goals met: 12 of 20
103. (increment c7)
   changed: (value c7) from 29 to 35
   goals met: 12 of 20
104. (decrement c6)
   changed: (value c6) from 82 to 76
   goals met: 12 of 20
105. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 12 of 20
106. (increment c7)
   changed: (value c7) from 35 to 42
   goals met: 12 of 20
107. (increment c7)
   changed: (value c7) from 42 to 49
   goals met: 12 of 20
108. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 12 of 20
109. (increment c8)
   changed: (value c8) from 25 to 31
   goals met: 12 of 20
110. (increment c8)
   changed: (value c8) from 31 to 37
   goals met: 11 of 20
111. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 11 of 20
112. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 11 of 20
113. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 11 of 20
114. (decrement c6)
   changed: (value c6) from 76 to 70
   goals met: 11 of 20
115. (decrement c6)
   changed: (value c6) from 70 to 64
   goals met: 11 of 20
116. (increment c8)
   changed: (value c8) from 37 to 43
   goals met: 11 of 20
117. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 11 of 20
118. (increment c7)
   changed: (value c7) from 49 to 59
   goals met: 11 of 20
119. (decrement c6)
   changed: (value c6) from 64 to 58
   goals met: 12 of 20
120. (increment c4)
   changed: (value c4) from 21 to 25
   goals met: 12 of 20
121. (increment c4)
   changed: (value c4) from 25 to 29
   goals met: 12 of 20
122. (increment c4)
   changed: (value c4) from 29 to 33
   goals met: 13 of 20
123. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 13 of 20
124. (increment c3)
   changed: (value c3) from 31 to 40
   goals met: 12 of 20
125. (increment c3)
   changed: (value c3) from 40 to 49
   goals met: 12 of 20
126. (increment c4)
   changed: (value c4) from 33 to 37
   goals met: 11 of 20
127. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 11 of 20
128. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 11 of 20
129. (increment c3)
   changed: (value c3) from 49 to 59
   goals met: 11 of 20
130. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 11 of 20
131. (decrement c4)
   changed: (value c4) from 37 to 33
   goals met: 12 of 20
132. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 12 of 20
133. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 12 of 20
134. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 12 of 20
135. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 12 of 20
136. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 12 of 20
137. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 12 of 20
138. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 12 of 20
139. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 12 of 20
140. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 12 of 20
141. (increment c12)
   changed: (value c12) from 34 to 43
   goals met: 12 of 20
142. (increment c12)
   changed: (value c12) from 43 to 52
   goals met: 12 of 20
143. (increment c12)
   changed: (value c12) from 52 to 61
   goals met: 12 of 20
144. (increment c12)
   changed: (value c12) from 61 to 70
   goals met: 12 of 20
145. (increment c12)
   changed: (value c12) from 70 to 79
   goals met: 12 of 20
146. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 12 of 20
147. (increment c12)
   changed: (value c12) from 79 to 89
   goals met: 11 of 20
148. (increment c12)
   changed: (value c12) from 89 to 99
   goals met: 12 of 20
149. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 12 of 20
150. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 12 of 20
151. (decrement c2)
   changed: (value c2) from 95 to 91
   goals met: 12 of 20
152. (decrement c2)
   changed: (value c2) from 91 to 87
   goals met: 12 of 20
153. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 12 of 20
154. (decrement c2)
   changed: (value c2) from 87 to 82
   goals met: 12 of 20
155. (decrement c2)
   changed: (value c2) from 82 to 77
   goals met: 12 of 20
156. (decrement c2)
   changed: (value c2) from 77 to 72
   goals met: 12 of 20
157. (decrement c2)
   changed: (value c2) from 72 to 67
   goals met: 12 of 20
158. (decrement c2)
   changed: (value c2) from 67 to 62
   goals met: 12 of 20
159. (decrement c2)
   changed: (value c2) from 62 to 57
   goals met: 13 of 20
160. (decrement c3)
   changed: (value c3) from 59 to 49
   goals met: 12 of 20
161. (decrement c3)
   changed: (value c3) from 49 to 39
   goals met: 12 of 20
162. (decrement c2)
   changed: (value c2) from 57 to 52
   goals met: 12 of 20
163. (increment c4)
   changed: (value c4) from 33 to 37
   goals met: 11 of 20
164. (increment c3)
   changed: (value c3) from 39 to 49
   goals met: 11 of 20
165. (decrement c2)
   changed: (value c2) from 52 to 47
   goals met: 12 of 20
166. (decrement c8)
   changed: (value c8) from 43 to 36
   goals met: 13 of 20
167. (decrement c7)
   changed: (value c7) from 59 to 49
   goals met: 12 of 20
168. (decrement c6)
   changed: (value c6) from 58 to 52
   goals met: 12 of 20
169. (decrement c6)
   changed: (value c6) from 52 to 46
   goals met: 13 of 20
170. (decrement c4)
   changed: (value c4) from 37 to 33
   goals met: 14 of 20
171. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 14 of 20
172. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 14 of 20
173. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 14 of 20
174. (increment c17)
   changed: (value c17) from 89 to 94
   goals met: 14 of 20
175. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 14 of 20
176. (increase_rate c17)
   changed: (rate_value c17) from 6 to 7
   goals met: 14 of 20
177. (increase_rate c17)
   changed: (rate_value c17) from 7 to 8
   goals met: 14 of 20
178. (increase_rate c17)
   changed: (rate_value c17) from 8 to 9
   goals met: 14 of 20
179. (decrement c16)
   changed: (value c16) from 96 to 89
   goals met: 14 of 20
180. (decrement c15)
   changed: (value c15) from 95 to 93
   goals met: 14 of 20
181. (decrement c15)
   changed: (value c15) from 93 to 91
   goals met: 14 of 20
182. (decrement c15)
   changed: (value c15) from 91 to 89
   goals met: 14 of 20
183. (decrement c15)
   changed: (value c15) from 89 to 87
   goals met: 15 of 20
184. (increment c18)
   changed: (value c18) from 76 to 86
   goals met: 15 of 20
185. (increase_rate c19)
   changed: (rate_value c19) from 0 to 1
   goals met: 15 of 20
186. (increase_rate c19)
   changed: (rate_value c19) from 1 to 2
   goals met: 15 of 20
187. (increase_rate c19)
   changed: (rate_value c19) from 2 to 3
   goals met: 15 of 20
188. (increment c19)
   changed: (value c19) from 74 to 77
   goals met: 15 of 20
189. (decrement c18)
   changed: (value c18) from 86 to 76
   goals met: 16 of 20
190. (decrement c7)
   changed: (value c7) from 49 to 39
   goals met: 15 of 20
191. (decrement c7)
   changed: (value c7) from 39 to 29
   goals met: 16 of 20
192. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 16 of 20
193. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 16 of 20
194. (increment c7)
   changed: (value c7) from 29 to 39
   goals met: 15 of 20
195. (increment c8)
   changed: (value c8) from 36 to 43
   goals met: 15 of 20
196. (decrement c6)
   changed: (value c6) from 46 to 38
   goals met: 16 of 20
197. (increment c18)
   changed: (value c18) from 76 to 86
   goals met: 15 of 20
198. (increment c18)
   changed: (value c18) from 86 to 96
   goals met: 16 of 20
199. (increase_rate c19)
   changed: (rate_value c19) from 3 to 4
   goals met: 16 of 20
200. (increase_rate c19)
   changed: (rate_value c19) from 4 to 5
   goals met: 16 of 20
201. (increase_rate c19)
   changed: (rate_value c19) from 5 to 6
   goals met: 16 of 20
202. (increment c19)
   changed: (value c19) from 77 to 83
   goals met: 16 of 20
203. (increment c19)
   changed: (value c19) from 83 to 89
   goals met: 16 of 20
204. (increment c19)
   changed: (value c19) from 89 to 95
   goals met: 16 of 20
205. (increment c4)
   changed: (value c4) from 33 to 40
   goals met: 15 of 20
206. (decrement c3)
   changed: (value c3) from 49 to 39
   goals met: 15 of 20
207. (decrement c2)
   changed: (value c2) from 47 to 42
   goals met: 14 of 20
208. (decrement c2)
   changed: (value c2) from 42 to 37
   goals met: 15 of 20
209. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 15 of 20
210. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 15 of 20
211. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 15 of 20
212. (decrement c1)
   changed: (value c1) from 45 to 42
   goals met: 15 of 20
213. (decrement c1)
   changed: (value c1) from 42 to 39
   goals met: 15 of 20
214. (decrement c1)
   changed: (value c1) from 39 to 36
   goals met: 16 of 20
215. (decrement c4)
   changed: (value c4) from 40 to 33
   goals met: 16 of 20
216. (decrement c3)
   changed: (value c3) from 39 to 29
   goals met: 16 of 20
217. (decrement c2)
   changed: (value c2) from 37 to 32
   goals met: 15 of 20
218. (decrement c2)
   changed: (value c2) from 32 to 27
   goals met: 16 of 20
219. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 16 of 20
220. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 16 of 20
221. (decrement c1)
   changed: (value c1) from 36 to 31
   goals met: 16 of 20
222. (decrement c1)
   changed: (value c1) from 31 to 26
   goals met: 17 of 20
223. (decrement c12)
   changed: (value c12) from 99 to 89
   goals met: 16 of 20
224. (decrement c12)
   changed: (value c12) from 89 to 79
   goals met: 17 of 20
225. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 17 of 20
226. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 17 of 20
227. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 17 of 20
228. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 17 of 20
229. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 17 of 20
230. (decrement c11)
   changed: (value c11) from 98 to 93
   goals met: 17 of 20
231. (decrement c11)
   changed: (value c11) from 93 to 88
   goals met: 17 of 20
232. (decrement c11)
   changed: (value c11) from 88 to 83
   goals met: 17 of 20
233. (decrement c11)
   changed: (value c11) from 83 to 78
   goals met: 18 of 20
234. (decrement c18)
   changed: (value c18) from 96 to 86
   goals met: 18 of 20
235. (decrement c17)
   changed: (value c17) from 94 to 85
   goals met: 18 of 20
236. (decrement c16)
   changed: (value c16) from 89 to 82
   goals met: 18 of 20
237. (decrement c15)
   changed: (value c15) from 87 to 85
   goals met: 17 of 20
238. (decrement c15)
   changed: (value c15) from 85 to 83
   goals met: 17 of 20
239. (decrement c15)
   changed: (value c15) from 83 to 81
   goals met: 18 of 20
240. (decrement c14)
   changed: (value c14) from 86 to 76
   goals met: 18 of 20
241. (decrement c13)
   changed: (value c13) from 85 to 80
   goals met: 18 of 20
242. (decrement c13)
   changed: (value c13) from 80 to 75
   goals met: 18 of 20
243. (decrement c12)
   changed: (value c12) from 79 to 69
   goals met: 18 of 20
244. (decrement c11)
   changed: (value c11) from 78 to 73
   goals met: 18 of 20
245. (decrement c11)
   changed: (value c11) from 73 to 68
   goals met: 19 of 20
246. (decrement c8)
   changed: (value c8) from 43 to 36
   goals met: 19 of 20
247. (decrement c7)
   changed: (value c7) from 39 to 29
   goals met: 19 of 20
248. (decrement c6)
   changed: (value c6) from 38 to 30
   goals met: 18 of 20
249. (decrement c6)
   changed: (value c6) from 30 to 22
   goals met: 19 of 20
250. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 19 of 20
251. (increment c6)
   changed: (value c6) from 22 to 31
   goals met: 18 of 20
252. (increment c7)
   changed: (value c7) from 29 to 39
   goals met: 18 of 20
253. (increment c8)
   changed: (value c8) from 36 to 43
   goals met: 18 of 20
254. (increment c6)
   changed: (value c6) from 31 to 40
   goals met: 18 of 20
255. (increment c7)
   changed: (value c7) from 39 to 49
   goals met: 18 of 20
256. (increment c8)
   changed: (value c8) from 43 to 50
   goals met: 19 of 20
257. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 19 of 20
258. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 19 of 20
259. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 19 of 20
260. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 19 of 20
261. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 19 of 20
262. (increment c9)
   changed: (value c9) from 37 to 42
   goals met: 19 of 20
263. (increment c9)
   changed: (value c9) from 42 to 47
   goals met: 19 of 20
264. (increment c9)
   changed: (value c9) from 47 to 52
   goals met: 20 of 20
